# Pandasüêº

## And Dataframes

In [1]:
import pandas as pd

In [2]:
mylist = ['pune','mumbai','delhi','banglore','hyderbad']

In [3]:
d = {
    'p' : 300,
    'q' : 301,
    'r' : 302,
    's' : 303,
    't' : 305
}

In [4]:
import numpy as np

In [5]:
arr = np.arange(1000, 1005)
arr

array([1000, 1001, 1002, 1003, 1004])

In [6]:
pd.Series(mylist)

0        pune
1      mumbai
2       delhi
3    banglore
4    hyderbad
dtype: object

In [7]:

type(pd.Series(list))

pandas.core.series.Series

In [8]:
pd.Series(mylist,arr)

1000        pune
1001      mumbai
1002       delhi
1003    banglore
1004    hyderbad
dtype: object

In [9]:
pd.Series(arr,mylist)

pune        1000
mumbai      1001
delhi       1002
banglore    1003
hyderbad    1004
dtype: int32

In [10]:
pd.Series(data = arr, index = mylist)

pune        1000
mumbai      1001
delhi       1002
banglore    1003
hyderbad    1004
dtype: int32

In [11]:
d.keys

In [12]:
d.keys()

dict_keys(['p', 'q', 'r', 's', 't'])

In [13]:
pd.Series(d)

p    300
q    301
r    302
s    303
t    305
dtype: int64

In [14]:
pd.Series(arr,d)

p    1000
q    1001
r    1002
s    1003
t    1004
dtype: int32

In [15]:
pd.Series(d,arr)

1000   NaN
1001   NaN
1002   NaN
1003   NaN
1004   NaN
dtype: float64

In [16]:
ser1 = pd.Series({'pune' : 1,'mumbai' : 2,'delhi' : 8,'banglore': 3,'hyderbad' : 5})
ser2 = pd.Series({'pune' : 1,'mumbai' : 2,'delhi' : 8,'chennai': 3,'hyderbad' : 5})

In [17]:
ser1 + ser2

banglore     NaN
chennai      NaN
delhi       16.0
hyderbad    10.0
mumbai       4.0
pune         2.0
dtype: float64

In [18]:

my_df1 = pd.DataFrame(np.random.randn(20).reshape(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])

In [19]:
type(my_df1)

pandas.core.frame.DataFrame

In [20]:
my_df1

          W         X         Y         Z
A  0.266592  0.619666 -1.021983  0.799188
B -0.010930  0.862320  0.025373  0.296432
C -0.467951  0.061730  0.989049 -0.811246
D -0.613671  1.163824 -0.698888  0.655051
E -1.573820 -1.820086 -0.159745 -1.683989

In [21]:
my_df1['W']

A    0.266592
B   -0.010930
C   -0.467951
D   -0.613671
E   -1.573820
Name: W, dtype: float64

In [22]:
type(my_df1['W'])

pandas.core.series.Series

In [23]:
type(my_df1[['X','Y']])

pandas.core.frame.DataFrame

In [24]:
my_df1[['X','Y']]

          X         Y
A  0.619666 -1.021983
B  0.862320  0.025373
C  0.061730  0.989049
D  1.163824 -0.698888
E -1.820086 -0.159745

In [25]:
my_df1.loc['D']

W   -0.613671
X    1.163824
Y   -0.698888
Z    0.655051
Name: D, dtype: float64

In [26]:
my_df1.iloc[3]

W   -0.613671
X    1.163824
Y   -0.698888
Z    0.655051
Name: D, dtype: float64

In [27]:
my_df1['W']>0

A     True
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [28]:
my_df1[my_df1['W']>0]

          W         X         Y         Z
A  0.266592  0.619666 -1.021983  0.799188

In [29]:
my_df1[my_df1['W']>0]['Y']

A   -1.021983
Name: Y, dtype: float64

In [30]:
int('1') + int('23')

24

In [31]:
int(True)

1

#

In [32]:
True + False + 5 + True

7

In [33]:
bool('r')

True

In [34]:
bool({})

False

In [35]:
bool(-8)

True

In [36]:
data = ['a','b','c','d','e']
result = []
for v in data:
    result.append(v.upper())
print(result)

['A', 'B', 'C', 'D', 'E']

In [37]:
'45'*5

'4545454545'

###

In [41]:
num1 = input("Enter a number: ")
num2 = int(num1[::-1])
num3= str(int(num1) + num2)
while num3 != num3[::-1]:
    num3 = str(int(num3) + int(num3[::-1]))
    print("Number is : ", num3)
    print("Revers is : ",num3[::-1])
print("Palindrom is : ", num3)

Enter a number: 34667
Number is :  124421
Revers is :  124421
Palindrom is :  124421

In [42]:
my_df1['W'].apply(lambda x : x>0)

A     True
B    False
C    False
D    False
E    False
Name: W, dtype: bool

In [43]:
my_df1['new'] = my_df1['W'] + my_df1['Y']

In [44]:
my_df1

          W         X         Y         Z       new
A  0.266592  0.619666 -1.021983  0.799188 -0.755391
B -0.010930  0.862320  0.025373  0.296432  0.014443
C -0.467951  0.061730  0.989049 -0.811246  0.521098
D -0.613671  1.163824 -0.698888  0.655051 -1.312559
E -1.573820 -1.820086 -0.159745 -1.683989 -1.733565

In [45]:
my_df1.drop('new',axis = 1)

          W         X         Y         Z
A  0.266592  0.619666 -1.021983  0.799188
B -0.010930  0.862320  0.025373  0.296432
C -0.467951  0.061730  0.989049 -0.811246
D -0.613671  1.163824 -0.698888  0.655051
E -1.573820 -1.820086 -0.159745 -1.683989

In [50]:
my_df1.drop('new',axis =1, inplace = True)
# droppping colums permanantely

In [51]:
my_df1.loc[['A','B'],['W','X']]

          W         X
A  0.266592  0.619666
B -0.010930  0.862320

In [52]:
newmind = 'CA NY WY OR CO'.split()

In [53]:
newmind

['CA', 'NY', 'WY', 'OR', 'CO']

In [54]:
my_df1['states'] = newmind

In [55]:
my_df1

          W         X         Y         Z states
A  0.266592  0.619666 -1.021983  0.799188     CA
B -0.010930  0.862320  0.025373  0.296432     NY
C -0.467951  0.061730  0.989049 -0.811246     WY
D -0.613671  1.163824 -0.698888  0.655051     OR
E -1.573820 -1.820086 -0.159745 -1.683989     CO

In [57]:
my_df1.set_index("states")

               W         X         Y         Z
states
CA      0.266592  0.619666 -1.021983  0.799188
NY     -0.010930  0.862320  0.025373  0.296432
WY     -0.467951  0.061730  0.989049 -0.811246
OR     -0.613671  1.163824 -0.698888  0.655051
CO     -1.573820 -1.820086 -0.159745 -1.683989

In [58]:
my_df1

          W         X         Y         Z states
A  0.266592  0.619666 -1.021983  0.799188     CA
B -0.010930  0.862320  0.025373  0.296432     NY
C -0.467951  0.061730  0.989049 -0.811246     WY
D -0.613671  1.163824 -0.698888  0.655051     OR
E -1.573820 -1.820086 -0.159745 -1.683989     CO

In [59]:
my_df1.set_index('states',inplace = True)
#deleting permanantly the colum states

In [60]:
my_df1

               W         X         Y         Z
states
CA      0.266592  0.619666 -1.021983  0.799188
NY     -0.010930  0.862320  0.025373  0.296432
WY     -0.467951  0.061730  0.989049 -0.811246
OR     -0.613671  1.163824 -0.698888  0.655051
CO     -1.573820 -1.820086 -0.159745 -1.683989

In [61]:
df = pd.DataFrame({'A' : [1,2,np.nan],
                  'B' : [5,np.nan, np.nan],
                  'C' : [1,2,3]})

In [62]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [63]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [64]:
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [71]:
df.dropna(thresh = 2)
#change 2 => tp => 1 or 3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [73]:
df.fillna(value = 'this_value')

            A           B  C
0           1           5  1
1           2  this_value  2
2  this_value  this_value  3

In [77]:
df.fillna(value = df['A'].mean())
#fills nan value with mean values

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [76]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [78]:
data = {'Company' : ['GOOG', 'GOOG', 'MSFT','MSFT','FB','FB'],
       'Person' : ['Sam', 'Charley','Amy', 'Vanessa', 'Carl', 'Sarah'],
       'Sales' : [200,120, 340, 124, 243, 350]}

In [79]:
df = pd.DataFrame(data)

In [80]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charley    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [81]:
df.sum()

Company             GOOGGOOGMSFTMSFTFBFB
Person     SamCharleyAmyVanessaCarlSarah
Sales                               1377
dtype: object

In [82]:
df.groupby('Company')

In [83]:
by_comp = df.groupby("Company")

In [84]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [85]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [86]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charley    120
MSFT         Amy    124

In [87]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [88]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [90]:
# 50% is the median
# if median is close to min value : left Skew data
# if median is close to max value : Righ Skew data
# if median is at equal distance from both : Normal distribution